In [7]:
import pandas as pd

In [9]:
pd.read_excel("data.xlsx")

     Name  School  Marks
0   Rudra     MLZ     55
1    Vasu     SAS     45
2     Dev     LMA     85
3  Raghav  LMAIGC     75
4    Isha     MFS     88

In [ ]:
#